titles = []

#Переменная i означает хотим ли мы продолжать ввод или нет
#n - счётчик количества ввёдённых заголовков. 

i = True
n = 0

print ('Для остановки программы введите "stop"')
while i :
    title = input(f'Введите заголовок №{n+1}: ')
    title = title.strip()
    #В случае пустого ввода проверяем дважды намерение пользователя завершить ввод
    if title == '' :
        title = input('Вы ввели пустой заголовок. Нажмите Enter повторно если желаете завершить ввод. ')
        if title == '' :
            i = False
    elif title == 'stop' :
        i = False
    else :
        n = n + 1
        titles.append(title)

print (f'Количество заголовоков: {n}. Вот они: ', titles)
