titles = []

# Переменная i означает хотим ли мы продолжать ввод или нет
# n - счётчик количества ввёдённых заголовков. Не обязательна

i = True
n = 0

print ('Для остановки программы введите "stop"')
while i :
    title = input(f'Введите заголовок №{n+1}: ').strip()

    if title == '' :
        # если пустой ввод то проверяем дважды намерение пользователя завершить.
        # но вообще пользователь может чето ввести и нас вернёт ко вводу заголовков
        title = input('Вы ввели пустой заголовок. Нажмите Enter повторно если желаете завершить ввод. ')
        if title == '' :
            i = False
    elif title == 'stop' :
        # если команда стоп - просто выходим
        i = False
    else :
        # любой другой текст запишется в заголовок
        n += 1
        titles.append(title)

print (f'Количество созданных заголовков: {n}. Вот они: ', titles)
