# Ввод данных с консоли
username = input("Введите имя пользователя: ")
print("Введите несколько заголовков для заметок")

# Создаем список заголовков заметки
titles = []
for i in range(3):
    title = input(f"Введите заголовок заметки {i + 1}: ")
    titles.append(title)

content = input("Введите описание заметки: ")
status = input("Введите статус заметки (например, 'В работе', 'Выполнена'): ")
new_date = input("Введите дату создания заметки в формате 'день-месяц-год': ")
#Здесь по идее должна быть проверка введённых данных и возвращение к вводу если данные не верны
end_date = input("Введите дату истечения заметки в формате 'день-месяц-год': ")
#и тут тоже проверка

# Вывод данных
print("\nВы ввели следующие данные:")
print("Имя пользователя:", username)
print("Заголовки:", titles)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", new_date)
print("Дата истечения заметки:", end_date)